# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'autoconf'
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'wget'
brew install 'autoconf'

# Development
brew 'php'
brew 'mariadb'
brew 'sqlite'
brew 'node'
brew 'yarn'
brew 'composer'

# Apps
cask 'aerial'
cask 'alfred'
cask 'blisk'
cask 'discord'
cask 'docker'
cask 'gitkraken'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'java'
cask 'kodi'
cask 'microsoft-office'
cask 'mjml'
cask 'opera'
cask 'phpstorm'
cask 'qbittorrent'
cask 'sequel-pro'
cask 'shuttle'
cask 'skype'
cask 'slack'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-lato'

# Php
pecl install xdebug

# Install Mac App Store apps
mas 'Todoist: Elenco delle attività | To-Do List', id: 585829637
mas 'Xcode', id: 497799835
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'The Unarchiver', id: 425424353
