# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'autoconf'
brew 'awscli'
brwe 'curl'
brew 'git'
brew 'hub'
brew 'kubernetes-ctl'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'tree'
brew 'wget'

# Development
brew 'composer'
brew 'go'
brew 'mysql@5.7'
brew 'node'
brew 'php'
brew 'redis'
brew 'sqlite'
brew 'yarn'

# Image tools
brew 'gifsicle'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'

# Apps
cask 'aerial'
cask 'alfred'
cask 'bettertouchtool'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'gitkraken'
cask 'goland'
cask 'google-backup-and-sync'
cask 'google-cloud-sdk'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'java8'
cask 'jdownloader'
cask 'minikube'
cask 'mjml'
cask 'opera'
cask 'phpstorm'
cask 'qbittorrent'
cask 'sequel-pro'
cask 'shuttle'
cask 'telegram-desktop'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-lato'

# Install Mac App Store apps
mas 'Todoist: Elenco delle attività | To-Do List', id: 585829637
mas 'Xcode', id: 497799835
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'The Unarchiver', id: 425424353
